
## 2.1 编译全部示例程序：
```shell
# cd build
# meson configure -Dexamples=all
# ninja
```

### 2.2.1 使用 meson 编译单个示例程序
```shell
# cd build
# meson configure -Dexamples=helloworld
# ninja
```

### 2.2.2 使用 make 编译单个示例程序
```shell
# cd examples/helloworld
# make
# make DEBUG=1
```

## 3.2 编译示例程序 cmdline
```
# cd cmdline
# make
# ls build/ -l
total 20
lrwxrwxrwx 1 root root    14 Mar 19 08:08 cmdline -> cmdline-shared
-rwxr-xr-x 1 root root 18880 Mar 19 08:08 cmdline-shared
```

## 3.3 运行应用程序 cmdline
```
# ./build/cmdline -l 0-3 -n 4
EAL: Detected CPU lcores: 8
EAL: Detected NUMA nodes: 1
EAL: Detected shared linkage of DPDK
EAL: Multi-process socket /var/run/dpdk/rte/mp_socket
EAL: Selected IOVA mode 'PA'
EAL: VFIO support initialized
TELEMETRY: No legacy callbacks, legacy socket not created
example> help
Demo example of command line interface in RTE

This is a readline-like interface that can be used to
debug your RTE application. It supports some features
of GNU readline like completion, cut/paste, and some
other special bindings.

This demo shows how rte_cmdline library can be
extended to handle a list of objects. There are
3 commands:
- add obj_name IP
- del obj_name
- show obj_name

example> add test01 192.168.1.1
Object test01 added, ip=192.168.1.1
example> show
Bad arguments
example> show test01
Object test01, ip=192.168.1.1
example> del test01
Object test01 removed, ip=192.168.1.1
example> show test01
Bad arguments
example> 
```

# 4 

绑定网卡
```shell
# ./usertools/dpdk-devbind.py -b vfio-pci 0000:02:04.0
# ./usertools/dpdk-devbind.py -s

Network devices using DPDK-compatible driver
============================================
0000:02:04.0 '82545EM Gigabit Ethernet Controller (Copper) 100f' drv=vfio-pci unused=e1000,igb_uio,uio_pci_generic

Network devices using kernel driver
===================================
0000:02:01.0 '82545EM Gigabit Ethernet Controller (Copper) 100f' if=ens33 drv=e1000 unused=igb_uio,vfio-pci,uio_pci_generic *Active*
0000:02:02.0 '82545EM Gigabit Ethernet Controller (Copper) 100f' if=ens34 drv=e1000 unused=igb_uio,vfio-pci,uio_pci_generic
0000:02:03.0 '82545EM Gigabit Ethernet Controller (Copper) 100f' if=ens35 drv=e1000 unused=igb_uio,vfio-pci,uio_pci_generic

No 'Baseband' devices detected
==============================

No 'Crypto' devices detected
============================

No 'DMA' devices detected
=========================

No 'Eventdev' devices detected
==============================

No 'Mempool' devices detected
=============================

No 'Compress' devices detected
==============================

No 'Misc (rawdev)' devices detected
===================================

No 'Regex' devices detected
===========================

No 'ML' devices detected
========================
```


运行ethtool
```shell
# ./build/examples/dpdk-ethtool -l 0-3 -n 4
EAL: Detected CPU lcores: 8
EAL: Detected NUMA nodes: 1
EAL: Detected static linkage of DPDK
EAL: Multi-process socket /var/run/dpdk/rte/mp_socket
EAL: Selected IOVA mode 'PA'
EAL: VFIO support initialized
EAL: Using IOMMU type 8 (No-IOMMU)
EAL: Ignore mapping IO port bar(4)
EAL: Probe PCI driver: net_e1000_em (8086:100f) device: 0000:02:04.0 (socket -1)
TELEMETRY: No legacy callbacks, legacy socket not created
Number of NICs: 1
Init port 0..
EAL: Error enabling MSI-X interrupts for fd 31
EthApp> help
Command not found
EthApp> drvinfo
firmware version get error: (Operation not supported)
Port 0 driver: net_e1000_em (ver: DPDK 23.11.0)
firmware-version:
bus-info: 0000:02:04.0
EthApp> link
Port 0: Up

EthApp> open
Bad arguments
EthApp> portstats
Bad arguments
EthApp> EAL: Error disabling MSI-X interrupts for fd 31
Closing port 0... Done
```

## 5.2 运行 helloworld
```
# ./build/examples/dpdk-helloworld -l 0-3 -n 4
EAL: Detected CPU lcores: 8
EAL: Detected NUMA nodes: 1
EAL: Detected static linkage of DPDK
EAL: Multi-process socket /var/run/dpdk/rte/mp_socket
EAL: Selected IOVA mode 'PA'
EAL: VFIO support initialized
EAL: Using IOMMU type 8 (No-IOMMU)
EAL: Ignore mapping IO port bar(4)
EAL: Probe PCI driver: net_e1000_em (8086:100f) device: 0000:02:04.0 (socket -1)
TELEMETRY: No legacy callbacks, legacy socket not created
hello from core 1
hello from core 2
hello from core 3
hello from core 0
EAL: Error disabling MSI-X interrupts for fd 31
```


## 6.2 运行 skeleton
```
# ./usertools/dpdk-devbind.py -b vfio-pci 0000:02:03.0
# ./usertools/dpdk-devbind.py -b vfio-pci 0000:02:04.0
# ./build/examples/dpdk-skeleton -l 1 -n 4

```

