
## 2.1 编译全部示例程序：
```shell
# cd build
# meson configure -Dexamples=all
# ninja
```

### 2.2.1 使用 meson 编译单个示例程序
```shell
# cd build
# meson configure -Dexamples=helloworld
# ninja
```

### 2.2.2 使用 make 编译单个示例程序
```shell
# cd examples/helloworld
# make
# make DEBUG=1
```

## 3.2 编译示例程序 cmdline
```
# cd cmdline
# make
# ls build/ -l
total 20
lrwxrwxrwx 1 root root    14 Mar 19 08:08 cmdline -> cmdline-shared
-rwxr-xr-x 1 root root 18880 Mar 19 08:08 cmdline-shared
```

## 3.3 运行应用程序 cmdline
```
# ./build/cmdline -l 0-3 -n 4
EAL: Detected CPU lcores: 8
EAL: Detected NUMA nodes: 1
EAL: Detected shared linkage of DPDK
EAL: Multi-process socket /var/run/dpdk/rte/mp_socket
EAL: Selected IOVA mode 'PA'
EAL: VFIO support initialized
TELEMETRY: No legacy callbacks, legacy socket not created
example> help
Demo example of command line interface in RTE

This is a readline-like interface that can be used to
debug your RTE application. It supports some features
of GNU readline like completion, cut/paste, and some
other special bindings.

This demo shows how rte_cmdline library can be
extended to handle a list of objects. There are
3 commands:
- add obj_name IP
- del obj_name
- show obj_name

example> add test01 192.168.1.1
Object test01 added, ip=192.168.1.1
example> show
Bad arguments
example> show test01
Object test01, ip=192.168.1.1
example> del test01
Object test01 removed, ip=192.168.1.1
example> show test01
Bad arguments
example> 
```


